import QuestionItem from "@components/Questions/QuestionItem.jsx";
import "./Questions.scss";

const Questions = () => {
  return (
    <div className="questions">
      <div className="container">
        <QuestionItem
          title="Що таке апостиль документів?"
          text="Апостиль («Apostille») – це спеціальний штамп на офіційних
            документах, які були складені на території України, яким
            засвідчуються справжність підпису, якість, в якій виступала особа,
            що підписала документ, та, у відповідному випадку, автентичність
            відбитку печатки або штампа, яким скріплено документ."
        />
        <QuestionItem
          title="Для яких країн проставляється апостиль документів"
          text="Апостиль документів визнають на будь-якому державному рівні в
            країнах-учасницях Гаазької Конвенції. В даний час цю Конвенцію
            підписали більше 136 держав, серед яких США, майже всі країни ЄС, а
            також Японія, Австралія."
        />
        <QuestionItem
          title="Що таке апостиль документів?"
          text="Апостиль («Apostille») – це спеціальний штамп на офіційних
            документах, які були складені на території України, яким
            засвідчуються справжність підпису, якість, в якій виступала особа,
            що підписала документ, та, у відповідному випадку, автентичність
            відбитку печатки або штампа, яким скріплено документ."
        />
        <QuestionItem
          title="Для яких країн проставляється апостиль документів"
          text="Апостиль документів визнають на будь-якому державному рівні в
            країнах-учасницях Гаазької Конвенції. В даний час цю Конвенцію
            підписали більше 136 держав, серед яких США, майже всі країни ЄС, а
            також Японія, Австралія."
        />
      </div>
    </div>
  );
};

export default Questions;

