import TemplatePage from "../../TemplatePage.jsx";
// import apostilleTextImg from "../../../../assets/media/Apostille.jpeg";

const content = [
  {
    type: "question",
    title: "Що таке апостиль документів?",
    blocks: [
      {
        type: "text",
        content:
          "Апостиль («Apostille») – це спеціальний штамп на офіційних документах, які були складені на території України, яким засвідчуються справжність підпису, якість, в якій виступала особа, що підписала документ, та, у відповідному випадку, автентичність відбитку печатки або штампа, яким скріплено документ.",
      },
    ],
  },
  {
    type: "question",
    title: "На які документи можна поставити апостиль?",
    blocks: [
      {
        type: "text",
        content:
          "Апостиль документів визнають на будь-якому державному рівні в країнах-учасницях Гаазької Конвенції. В даний час цю Конвенцію підписали більше 136 держав, серед яких США, майже всі країни ЄС, а також Японія, Австралія.",
      },
      {
        type: "image",
        src: "../../../../assets/media/Apostille.jpeg",
        alt: "content image",
      },
      {
        type: "list",
        content: [
          "Свідоцтва про народження, шлюб, розлучення",
          "Дипломи, атестати, довідки з навчальних закладів",
          "Довідки про несудимість",
          "Нотаріально завірені доручення, договори",
          "Судові та фінансові документи",
        ],
      },
      {
        type: "text",
        content:
          "Апостиль документів визнають на будь-якому державному рівні в країнах-учасницях Гаазької Конвенції. В даний час цю Конвенцію підписали більше 136 держав, серед яких США, майже всі країни ЄС, а також Японія, Австралія.",
      },
    ],
  },
  {
    type: "question",
    title: "Що таке апостиль документів?",
    text: "Апостиль («Apostille») – це спеціальний штамп на офіційних документах, які були складені на території України, яким засвідчуються справжність підпису, якість, в якій виступала особа, що підписала документ, та, у відповідному випадку, автентичність відбитку печатки або штампа, яким скріплено документ.",
  },
];

const ExchangeAgreement = () => {
  return (
    <TemplatePage
      title={"Договір міни майна"}
      content={content}
      heroImgClass={"notaryServicesPage"}
    />
  );
};

export default ExchangeAgreement;
