import { useIsPC } from "@hooks/isPC";
import Breadcrumbs from "@components/BreadCrumbs/BreadCrumbs";
import "./OfferAndPolicy.scss";

const OfferPage = () => {
  const isPC = useIsPC();
  let offerItems = [
    {
      title: "",
      paragraphs: [
        "За цим Договором Продавець, з однієї сторони, і будь-яка особа, яка прийняла умови цього Договору публічної оферти — Покупець, з іншої сторони, надалі разом — Сторони, уклали цей Публічний договір купівлі-продажи товару (надалі — “Договір” або “Публічний договір”), адресований необмеженому колу осіб, який є офіційною публічною пропозицією Продавця укласти з Покупцями договір купівлі-продажу Товарів, фотографії яких розміщені на сайті: https://cultboutique.com.ua (надалі – “Сайт”, “Інтернет-магазин”, відповідно).",
        "Продавець, що здійснює продаж Товарів за допомогою Інтернет-магазину та Покупці, при придбанні Товарів, зображення яких розміщені на відповідних сторінках Інтернет-магазину, приймають умови цього Договору про нижченаведене.",
        "Умови даного Договору регулюють взаємовідносини Продавця і Покупця та визначаються Законом України «Про захист прав споживачів» № 1023-XII від 12 травня 1991 року, Правилами роздрібної торгівлі непродовольчими товарами, затвердженими наказом Міністерства економіки України № 104 від 19 квітня 2007 року.",
        "Ця угода носить характер публічної оферти, є еквівалентом “усної угоди” і відповідно до чинного законодавства України має належну юридичну силу.",
      ],
    },
    {
      title: "1. Загальні положення",
      paragraphs: [
        "1.1. Цей договір є публічною офертою ( відповідно до ст. 633, 641 і гл. 63 Цивільного кодексу України) і містить всі істотні умови організації купівлі-продажу дистанційним способом, тобто через інтернет-магазин.",
        "1.2. У відповідності до ст. 642 Цивільного Кодексу України повним і безсуперечним прийняттям умов публічного договору, тобто публічної оферти інтернет-магазину є факт натисканням на посилання «Додати до кошика», «Швидке замовлення» або «Залишити заявку» та оплати замовлення в розмірі 100% на умовах цієї угоди.",
        "1.3. Публічна оферта також є прийнятою при реєстрації Покупця на сайті інтернет-магазину.",
        "1.4. Укладаючи Договір, Покупець підтверджує, що цілком і повністю ознайомлений та згоден з його умовами, а також, у разі, якщо Покупець є фізичною особою, дає дозвіл на обробку своїх персональних даних з метою можливості виконання умов цього Договору, можливості проведення взаєморозрахунків, а також для отримання рахунків, актів та інших документів. Дозвіл на обробку персональних даних діє протягом усього строку дії Договору. Крім цього, укладанням цього Договору, Покупець підтверджує, що йому повідомлено (без додаткового повідомлення) про права, встановлені Законом України «Про захист персональних даних», про цілі збору даних. Обсяг прав Покупця, як суб'єкта персональних даних відповідно до Закону України «Про захист персональних даних», йому відомий і зрозумілий.",
      ],
    },
    {
      title: "2. Терміни та визначення",
      paragraphs: [
        "2.1. «Інтернет – магазин» -сайт Продавця («cultboutique.com.ua»), створений для укладення договорів роздрібної та оптової купівлі – продажу на підставі ознайомлення Покупця з запропонованим Продавцем описом Товару на фотознімках, за допомогою мережі Інтернет, що виключає можливість безпосереднього ознайомлення Покупця з Товаром – дистанційним засобом продажу товару.",
        "2.2. «Товар» - перелік найменувань асортименту, представлений в інтернет-магазині.",
        "2.3. «Персональні дані» – будь-яка інформація, яка прямо чи опосередковано відноситься до певної особи, чи до особи, яка визначається.",
        "2.4. «Істотний недолік Товару» – недолік, який робить неможливим чи недопустимим використання товару відповідно до його цільового призначення, виник з вини виробника (Продавця), після його усунення проявляється знову з незалежних від споживача причин і при цьому наділений хоча б однією з нижченаведених ознак:",
        "а) він взагалі не може бути усунутий;",
        "б) його усунення потребує понад чотирнадцять календарних днів;",
        "в) він робить товар суттєво іншим, ніж передбачено договором.",
      ],
    },
  ];
  return (
    <>
      <div className="container text-container">
        <Breadcrumbs />
        <h1
          className={`offer-title ${isPC ? "fs-h2--40px" : "fs-h2--24px"} fw-bold uppercase`}
        >
          Договір оферти
        </h1>
        <div className="content">
          {offerItems.map((item, index) => (
            <div key={index} className="content-block-item">
              <h3
                className={`${isPC ? "fs-p--16px" : "fs-p--14px"} uppercase fw-semi-bold lh-150 content-block-title`}
              >
                {item.title}
              </h3>
              {item.paragraphs.map((paragraph, i) => (
                <p
                  key={i}
                  className={`${isPC ? "fs-p--16px" : "fs-p--14px"} lh-150 content-block-text`}
                >
                  {paragraph}
                </p>
              ))}
            </div>
          ))}
        </div>
      </div>
    </>
  );
};

export default OfferPage;
