import Breadcrumbs from "@components/BreadCrumbs/BreadCrumbs";
import { useIsPC } from "@hooks/isPC";

import "./ContactsPage.scss";
import VideoBlock from "@components/VideoBock/VideoBlock";

const ContactsPage = () => {
  const isPC = useIsPC();
  return (
    <div className="contacts-page bg1">
      <div className="container">
        <Breadcrumbs />
        <div className="contacts-wrap">
          <div className="contacts">
            <h2
              className={`${isPC ? "fs-h2--40px" : "fs-h2--24px"} fw-bold uppercase`}
            >
              Контакти
            </h2>
            <ul className="contacts-info">
              <li>
                <h4
                  className={`${isPC ? "fs-p--18px" : "fs-p--14px"} fw-normal lh-150`}
                >
                  Зателефонуйте нам
                </h4>
                <a
                  href="tel:+380678200700"
                  className={`${isPC ? "fs-p--24px" : "fs-p--16px"} fw-semi-bold tel-link`}
                >
                  +38 067 820 07 00
                </a>
                <a
                  href="tel:+380675440700"
                  className={`${isPC ? "fs-p--24px" : "fs-p--16px"} fw-semi-bold tel-link`}
                >
                  +38 067 544 07 00
                </a>
              </li>
              <li>
                <h4
                  className={`${isPC ? "fs-p--18px" : "fs-p--14px"} fw-normal lh-150`}
                >
                  Електронна пошта
                </h4>
                <a
                  href="mailto:nknotary.dnipro@gmail.com"
                  className={`${isPC ? "fs-p--24px" : "fs-p--16px"} fw-semi-bold`}
                >
                  nknotary.dnipro@gmail.com
                </a>
              </li>
              <li>
                <h4
                  className={`${isPC ? "fs-p--18px" : "fs-p--14px"} fw-normal lh-150`}
                >
                  Час роботи
                </h4>
                <p
                  className={`${isPC ? "fs-p--24px" : "fs-p--16px"} fw-semi-bold`}
                >
                  Пн-Пт 9:00-18:00
                </p>
              </li>
              <li>
                <h4
                  className={`${isPC ? "fs-p--18px" : "fs-p--14px"} fw-normal lh-150`}
                >
                  Наша адреса
                </h4>
                <a
                  href="#"
                  className={`${isPC ? "fs-p--24px" : "fs-p--16px"} fw-semi-bold`}
                >
                  Україна, м. Дніпро, бул. Слави, 2-Б, 49100
                </a>
              </li>
              <li>
                <h4
                  className={`${isPC ? "fs-p--18px" : "fs-p--14px"} fw-normal lh-150`}
                >
                  Слідкуйте за нами в соцмережах
                </h4>
                <ul className="socials">
                  <li className="socials-item">
                    <a href="#" className="socials-item-link">
                      <svg
                        className="socials-item-img"
                        width="20"
                        height="20"
                        viewBox="0 0 20 20"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                      >
                        <g clipPath="url(#clip0_254_819)">
                          <path
                            d="M5.1202 0C8.37354 0 11.6269 0 14.8802 0C15.0869 0.0333333 15.2935 0.0533333 15.4935 0.1C17.7602 0.606667 19.2135 1.98 19.8335 4.22C19.9135 4.51333 19.9469 4.82 20.0002 5.12V14.88C19.9869 14.9467 19.9802 15.02 19.9602 15.0867C19.8269 15.6067 19.7602 16.16 19.5402 16.64C18.5469 18.7933 16.8335 19.9467 14.4535 19.98C11.4869 20.02 8.5202 19.9933 5.55354 19.9867C4.40687 19.9867 3.3402 19.6733 2.4002 19.0067C0.813536 17.8733 0.0135359 16.3133 0.00686921 14.3667C0.000202546 11.4533 0.00686921 8.54 0.00686921 5.62C0.00686921 5.24667 0.0268692 4.86 0.106869 4.49333C0.613536 2.23333 1.99354 0.786667 4.2202 0.166667C4.51354 0.0866667 4.8202 0.0533333 5.1202 0ZM18.2202 10C18.2202 8.55333 18.2202 7.11333 18.2202 5.66667C18.2202 5.20667 18.1735 4.76 18.0202 4.32667C17.4535 2.74 16.0869 1.78 14.3602 1.78C11.4535 1.78 8.54687 1.77333 5.6402 1.78667C5.20687 1.78667 4.74687 1.84667 4.3402 1.98667C2.7402 2.52 1.78687 3.90667 1.78687 5.63333C1.78687 8.54 1.78687 11.4467 1.78687 14.3533C1.78687 14.8067 1.83354 15.2467 1.99354 15.6733C2.5602 17.2467 3.91354 18.2067 5.6202 18.2133C8.54687 18.22 11.4735 18.2133 14.4002 18.2133C15.7135 18.2133 16.7669 17.6867 17.5402 16.62C18.0335 15.9467 18.2269 15.1733 18.2269 14.3467C18.2269 12.8933 18.2269 11.4467 18.2269 9.99333L18.2202 10Z"
                            fill="#1A1A1A"
                          />
                          <path
                            d="M15.1526 9.99368C15.1526 12.8203 12.8259 15.1537 9.99926 15.147C7.16593 15.147 4.83926 12.8137 4.8526 9.98701C4.85926 7.16035 7.16593 4.85368 9.99926 4.84035C12.8259 4.83368 15.1526 7.16035 15.1593 9.98701L15.1526 9.99368ZM13.3726 9.99368C13.3726 8.13368 11.8526 6.62035 9.99926 6.62035C8.13926 6.62035 6.62593 8.14035 6.62593 9.99368C6.62593 11.8537 8.14593 13.367 9.99926 13.367C11.8593 13.367 13.3726 11.847 13.3726 9.99368Z"
                            fill="#1A1A1A"
                          />
                          <path
                            d="M15.4004 3.34719C16.1137 3.36719 16.6937 3.96719 16.6737 4.66053C16.6537 5.39386 16.0537 5.96053 15.3271 5.93386C14.6271 5.90719 14.0538 5.30719 14.0738 4.62053C14.0938 3.89386 14.6871 3.32719 15.4004 3.34719Z"
                            fill="#1A1A1A"
                          />
                        </g>
                      </svg>
                    </a>
                  </li>
                  <li className="socials-item">
                    <a
                      href="#"
                      className="socials-item-link"
                      aria-label="facebook"
                    >
                      <svg
                        width="20"
                        height="20"
                        viewBox="0 0 20 20"
                        xmlns="http://www.w3.org/2000/svg"
                        className="socials-item-img"
                      >
                        <g clipPath="url(#clip0_254_825)">
                          <path d="M11.8892 12.1117V20.8333H7.67121V12.1117H4.16699V8.57526H7.67121V7.28858C7.67121 2.51171 9.77212 0 14.2173 0C15.58 0 15.9207 0.208025 16.667 0.377527V3.87543C15.8315 3.73675 15.5963 3.6597 14.7283 3.6597C13.6981 3.6597 13.1465 3.93707 12.6436 4.4841C12.1407 5.03113 11.8892 5.9788 11.8892 7.33481V8.58296H16.667L15.3854 12.1194H11.8892V12.1117Z" />
                        </g>
                      </svg>
                    </a>
                  </li>
                  <li className="socials-item">
                    <a href="#" className="socials-item-link">
                      <svg
                        width="19"
                        height="20"
                        viewBox="0 0 19 20"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                        className="socials-item-img"
                      >
                        <path
                          d="M13.5678 0.760815L13.0792 0H10.1222V6.85231L10.1122 13.5455C10.1172 13.5952 10.1222 13.6499 10.1222 13.6996C10.1222 15.3754 8.74198 16.7429 7.03933 16.7429C5.33668 16.7429 3.95643 15.3804 3.95643 13.6996C3.95643 12.0239 5.33668 10.6564 7.03933 10.6564C7.39195 10.6564 7.73449 10.721 8.05185 10.8304V7.48881C7.72442 7.43411 7.38691 7.40427 7.03933 7.40427C3.52825 7.40925 0.666992 10.2337 0.666992 13.7046C0.666992 17.1755 3.52825 20 7.04437 20C10.5605 20 13.4217 17.1755 13.4217 13.7046V5.74341C14.6962 7.00149 16.3434 8.22974 18.167 8.62257V5.20636C16.1873 4.34112 14.2177 1.78518 13.5678 0.760815Z"
                          fill="currentColor"
                        />
                      </svg>
                    </a>
                  </li>
                  <li className="socials-item">
                    <a href="#" className="socials-item-link">
                      <svg
                        width="15"
                        height="14"
                        viewBox="0 0 15 14"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                        className="socials-item-img"
                      >
                        <path
                          fillRule="evenodd"
                          clipRule="evenodd"
                          d="M1.03117 6.02691C5.0577 4.05119 7.74268 2.74867 9.08611 2.11936C12.9219 0.322542 13.7189 0.0104165 14.2384 0.000109891C14.3527 -0.00215693 14.6082 0.0297341 14.7737 0.180964C14.9134 0.30866 14.9518 0.481158 14.9702 0.602228C14.9886 0.723297 15.0115 0.999097 14.9933 1.2146C14.7855 3.6743 13.8861 9.64335 13.4285 12.3983C13.2349 13.564 12.8536 13.9548 12.4845 13.9931C11.6825 14.0762 11.0734 13.3961 10.2965 12.8225C9.08085 11.9251 8.39409 11.3664 7.21409 10.4907C5.8504 9.47859 6.73442 8.92233 7.51159 8.01324C7.71498 7.77533 11.249 4.15509 11.3174 3.82668C11.326 3.7856 11.3339 3.6325 11.2532 3.55166C11.1724 3.47081 11.0532 3.49846 10.9672 3.52045C10.8453 3.55161 8.90325 4.99723 5.14115 7.85731C4.58991 8.2836 4.09062 8.49131 3.64327 8.48042C3.15011 8.46842 2.20146 8.16638 1.49623 7.90821C0.631245 7.59154 -0.0562297 7.42412 0.00363389 6.88633C0.0348146 6.60622 0.377327 6.31974 1.03117 6.02691Z"
                          fill="#0C0C0C"
                        />
                      </svg>
                    </a>
                  </li>
                </ul>
              </li>
            </ul>
          </div>
          <div className="map">
            <iframe
              src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d10592.965282032119!2d35.06165928172935!3d48.413511201811616!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x40dbfc974a7b4189%3A0xdb629d4ea8646b9b!2z0LHRg9C7LiDQodC70LDQstGLLCAy0JEsINCU0L3QtdC_0YAsINCU0L3QtdC_0YDQvtC_0LXRgtGA0L7QstGB0LrQsNGPINC-0LHQu9Cw0YHRgtGMLCA0OTAwMA!5e0!3m2!1suk!2sua!4v1756709914014!5m2!1suk!2sua"
              width={`100%`}
              height={`${isPC ? "700" : "400"}`}
              style={{ border: 0 }}
              allowFullScreen
              loading="lazy"
              referrerPolicy="no-referrer-when-downgrade"
            />
          </div>
        </div>
      </div>
      <VideoBlock
        title="Як нас знайти"
        description="Маршрут до нас — покроково у відео"
      />
    </div>
  );
};

export default ContactsPage;
